[
    {
        "page": "About",
        "path": "/",
        "section_title": "Hello! This is",
        "title": "NAFISUL HAQUE KAHN",
        "detail": "Web Designer & Developer",
        "section_paragraph": "I am a front-end leaning fullstack developer who also has working experince in design. I love doing creative and unique projects that chalanges my skills. I love building  do web animations and unique features. My background in design helps me build visually appealing, user-friendly, and scalable web applications by combining strong aesthetics with modern frontend and backend development practices."
    },
    {
        "page": "Technologies",
        "path": "/technologies",
        "section_title": "Here are",
        "title": "THE TECHNOLOGIES",
        "detail": "I use in my Projects",
        "section_paragraph": "The technologies, tools, and frameworks I use to design and develop modern web applications. From frontend libraries and backend frameworks to databases and design tools, these technologies help me create efficient, scalable, and visually polished digital solutions."
    },
    {
        "page": "Projects",
        "path": "/projects",
        "section_title": "Here are",
        "title": "THE PROJECTS",
        "detail": "I did till now",
        "section_paragraph": "The projects that demonstrate my skills in frontend and backend development, problem-solving, and UI design. Each project reflects real-world use cases, clean architecture, and thoughtful design decisions built using modern web technologies."
    },
    {
        "page": "Experience",
        "path": "/experience",
        "section_title": "Here are",
        "title": "THE EXPERIENCES",
        "detail": "I acquired throughout my career",
        "section_paragraph": "My professional experience includes working as a creative visualizer for 3 years and evolving into a web developer. This journey has strengthened my ability to blend design thinking with technical execution, allowing me to contribute effectively to both visual and functional aspects of web projects."
    },
    {
        "page": "Contact",
        "path": "/contact",
        "section_title": "Here are",
        "title": "THE CONNECTIONS",
        "detail": "to Connect directly with me",
        "section_paragraph": "This page contains my contact information and ways to get in touch. Whether you want to discuss a project, collaboration, or opportunity, feel free to reach out. I’m always open to connecting and creating meaningful digital experiences together."
    }
]